---
kind: type
id: T:Autodesk.Revit.DB.Structure.BendingDetailSegmentLengthsDisplayOptions
source: html/b31596b6-b98a-e3ce-5a99-62589d74152a.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailSegmentLengthsDisplayOptions

Describes if the segment lengths are represented using dimensions or just as text.

## Syntax (C#)
```csharp
public enum BendingDetailSegmentLengthsDisplayOptions
```